# Working with datetime in Pandas DataFrame

<img src="images/datetimememe.webp">

In [37]:
import pandas as pd
import numpy as np

### 1. Convert strings to datetime

#### Default arguments

In [38]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [39]:
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [41]:
df['date'] = pd.to_datetime(df['date'])

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 180.0 bytes

In [43]:
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

#### Day first format

In [44]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [45]:
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

#### Custom format 

Ref - https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [46]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")

In [47]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

#### Speedup parsing with infer_datetime_format

In [48]:
df = pd.DataFrame({'date': ['3/11/2000', '3/12/2000', '3/13/2000'] * 1000 })
df.head()

        date
0  3/11/2000
1  3/12/2000
2  3/13/2000
3  3/11/2000
4  3/12/2000

#### Handle parsing error

In [65]:
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [66]:
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [67]:
df['date'] = pd.to_datetime(df['date'], errors='ignore')
df

C:\Users\kunamaha\AppData\Local\Temp\ipykernel_54860\3639693634.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df['date'] = pd.to_datetime(df['date'], errors='ignore')

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [68]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

### 2. Assemble a datetime from multiple columns

In [69]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})

In [70]:
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [71]:

df['date'] = pd.to_datetime(df)

In [72]:
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

### 3. Get year, month and day

In [73]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})

In [74]:
df

    name         DoB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12-16-1995

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [76]:
df['DoB'] = pd.to_datetime(df['DoB'])

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 180.0+ bytes

In [78]:
df['year']= df['DoB'].dt.year
df['month']= df['DoB'].dt.month
df['day']= df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

### 4. Get the week of year, the day of week and leap year

In [82]:
df['week_of_year'] = df['DoB'].dt.weekday
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  year  month  day  day_of_week  is_leap_year  week_of_year
0    Tom 1997-08-05  1997      8    5            1         False             1
1   Andy 1996-04-28  1996      4   28            6          True             6
2  Lucas 1995-12-16  1995     12   16            5         False             5

In [83]:
df['DoB'].dt.weekday

0    1
1    6
2    5
Name: DoB, dtype: int32

In [84]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,day_of_week,is_leap_year,week_of_year,day_of_week_name
0,Tom,1997-08-05,1997,8,5,1,False,1,Tuesday
1,Andy,1996-04-28,1996,4,28,6,True,6,Sunday
2,Lucas,1995-12-16,1995,12,16,5,False,5,Saturday

### 5. Get the age from the date of birth

In [44]:
pd.to_datetime('today').year - df['DoB'].dt.year

0    26
1    27
2    28
Name: DoB, dtype: int64

0    1997
1    1996
2    1995
Name: DoB, dtype: int64

In [45]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year

df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,26
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,27
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,28

In [52]:
# Year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year


# Haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )
no_birthday = b_md > (today.month,today.day)

df['age'] = diff_y - no_birthday
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,25
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,26
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,27

In [51]:
no_birthday

0    True
1    True
2    True
Name: DoB, dtype: bool

### 6. Improve performance by setting date column as the index

In [85]:
df = pd.read_csv('data/city_sales.csv',parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [86]:
df = df.set_index(['date'])

In [87]:
df

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

### 7. Select data with a specific year and perform aggregation

In [91]:
df.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [89]:
df.loc['2018','num'].sum()

132127

In [96]:
df.loc['2018'].groupby('city').sum()

           num
city
London  132127

### 8. Select data with a specific month or a specific day of the month

In [59]:
df.loc['2018-5']

                     num       city
date
2018-05-01 09:00:00    1     London
2018-05-01 09:01:00    4     London
2018-05-01 09:02:00    3     London
2018-05-01 09:03:00    2     London
2018-05-01 09:04:00    3     London
...                  ...        ...
2018-05-31 15:56:00    3  Cambridge
2018-05-31 15:57:00    4  Cambridge
2018-05-31 15:58:00    2  Cambridge
2018-05-31 15:59:00    3  Cambridge
2018-05-31 16:00:00    3  Cambridge

[38732 rows x 2 columns]

In [60]:
df.loc['2018-5-1']

                     num       city
date
2018-05-01 09:00:00    1     London
2018-05-01 09:01:00    4     London
2018-05-01 09:02:00    3     London
2018-05-01 09:03:00    2     London
2018-05-01 09:04:00    3     London
...                  ...        ...
2018-05-01 15:56:00    2  Cambridge
2018-05-01 15:57:00    3  Cambridge
2018-05-01 15:58:00    3  Cambridge
2018-05-01 15:59:00    3  Cambridge
2018-05-01 16:00:00    1  Cambridge

[1684 rows x 2 columns]

In [97]:
cond = df.index.month==3

In [98]:
cond

array([False, False, False, ..., False, False, False])

In [99]:
df[cond]

                     num    city
date
2015-03-02 09:00:00    1  London
2015-03-02 09:01:00    3  London
2015-03-02 09:02:00    2  London
2015-03-02 09:03:00    3  London
2015-03-02 09:04:00    1  London
...                  ...     ...
2018-03-30 15:56:00    4  London
2018-03-30 15:57:00    2  London
2018-03-30 15:58:00    3  London
2018-03-30 15:59:00    3  London
2018-03-30 16:00:00    3  London

[37890 rows x 2 columns]

In [100]:
cond = df.index.month==2
df[cond]

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London
...                  ...     ...
2018-02-28 15:56:00    3  London
2018-02-28 15:57:00    3  London
2018-02-28 15:58:00    3  London
2018-02-28 15:59:00    2  London
2018-02-28 16:00:00    3  London

[34101 rows x 2 columns]

### 9. Select data between two dates

In [101]:
df.loc['2016' : '2018']

                     num    city
date
2016-01-01 09:00:00    4  London
2016-01-01 09:01:00    3  London
2016-01-01 09:02:00    4  London
2016-01-01 09:03:00    4  London
2016-01-01 09:04:00    2  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[266552 rows x 2 columns]

In [102]:
df.loc['2018-5-2 10' : '2018-5-2 11' ]

                     num    city
date
2018-05-02 10:00:00    2  London
2018-05-02 10:01:00    3  London
2018-05-02 10:02:00    4  London
2018-05-02 10:03:00    4  London
2018-05-02 10:04:00    4  London
...                  ...     ...
2018-05-02 11:55:00    4  London
2018-05-02 11:56:00    3  London
2018-05-02 11:57:00    4  London
2018-05-02 11:58:00    3  London
2018-05-02 11:59:00    4  London

[120 rows x 2 columns]

In [103]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45' ]

                     num    city
date
2018-05-02 10:30:00    3  London
2018-05-02 10:31:00    3  London
2018-05-02 10:32:00    1  London
2018-05-02 10:33:00    3  London
2018-05-02 10:34:00    3  London
2018-05-02 10:35:00    3  London
2018-05-02 10:36:00    3  London
2018-05-02 10:37:00    2  London
2018-05-02 10:38:00    3  London
2018-05-02 10:39:00    3  London
2018-05-02 10:40:00    2  London
2018-05-02 10:41:00    4  London
2018-05-02 10:42:00    3  London
2018-05-02 10:43:00    3  London
2018-05-02 10:44:00    3  London
2018-05-02 10:45:00    4  London

In [104]:
df.between_time('10:30','10:45')

                     num    city
date
2015-01-01 10:30:00    4  London
2015-01-01 10:31:00    3  London
2015-01-01 10:32:00    3  London
2015-01-01 10:33:00    3  London
2015-01-01 10:34:00    4  London
...                  ...     ...
2018-06-05 10:41:00    3  London
2018-06-05 10:42:00    3  London
2018-06-05 10:43:00    1  London
2018-06-05 10:44:00    2  London
2018-06-05 10:45:00    3  London

[14304 rows x 2 columns]